/**
  ******************************************************************************
  * @文件    工程/STM32F10x_StdPeriph_Template/stm32f10x_it.h
  * @作者    MCD应用团队
  * @版本    V3.5.0
  * @日期    2011-04-08
  * @简介   该文件包含中断处理程序的声明。
  ******************************************************************************
  * @注意
  *
  * 本固件仅供参考，旨在为客户提供关于其产品的编码信息，以便为他们节省时间。
  * 因此，对于因使用该固件和/或此处包含的编码信息而导致与客户产品相关的任何
  * 直接、间接或后果性损害的索赔，STMicroelectronics概不负责。
  *
  * <h2><center>&copy; 版权所有 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* 定义以防止递归包含 --------------------------------------------------------*/
#ifndef __STM32F10x_IT_H
#define __STM32F10x_IT_H

#ifdef __cplusplus
extern "C" {
#endif

/* 包含文件 ------------------------------------------------------------------*/
#include "stm32f10x.h"

/* 导出类型 ------------------------------------------------------------------*/
/* 导出常量 ------------------------------------------------------------------*/
/* 导出宏 --------------------------------------------------------------------*/
/* 导出函数 ------------------------------------------------------------------*/

void NMI_Handler(void);
void HardFault_Handler(void);
void MemManage_Handler(void);
void BusFault_Handler(void);
void UsageFault_Handler(void);
void SVC_Handler(void);
void DebugMon_Handler(void);
void PendSV_Handler(void);
void SysTick_Handler(void);

#ifdef __cplusplus
}
#endif

#endif /* __STM32F10x_IT_H */

/******************* (C) 版权所有 2011 STMicroelectronics *****文件结束****/
